OpenFOAM_Artery_Lab_ADT/CFD_AAA/Aorta_novikov_01/system/snappyHexMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers true;
geometry
{
  aortaWall
  {
    type triSurfaceMesh;
    file "aortaWall.stl";
  }
  
  outlet1
	{
		type	triSurfaceMesh;
		file	"outlet1.stl";
	}
	
	outlet2
	{
		type	triSurfaceMesh;
		file	"outlet2.stl";
		
	}
  
  
  
} 

	/*refinementBox
    {
        type searchableBox;
    	 min (0.0375 -0.0495 0.145);
         max (0.102 -0.0045 0.185);
    }*/

castellatedMeshControls
{
  maxLocalCells 65000000;
  maxGlobalCells 70000000;
  minRefinementCells 1;
  maxLoadUnbalance 0.1;
  nCellsBetweenLevels 3;
  features
    (

      {
        file "aortaWall.eMesh";
        level 0;

      }
      
      
      {
		file	"outlet1.eMesh";
		level 0;
	}
	
	{
		file	"outlet2.eMesh";
		level 0;
	}
      
    );
    
    
    
    
  refinementSurfaces
  {
    aortaWall
    		{
	 		level( 0 0 );
	 		patchInfo
		{
			type	patch;
			}
		}  
    
    
    outlet1
		{
			level	( 0 0 );
			patchInfo
			{
				type	patch;
			}
		}
		

    outlet2
    
		{
			level	( 0 0 );
			patchInfo
			{
				type	patch;
			}
		}
    
  
  }
  
  
  resolveFeatureAngle 10;
  
  refinementRegions
  {
  
 	 aortaWall
		{
   		 mode  distance;           // refinement level 3 within 2.0 m
      		  levels ( (0.0007 1)); // levels must be ordered nearest first
 		}
  
  }
  
  
    locationInMesh ( 0.008321136184611505   0.00013602828381768794  -0.060750733516220234 );
  
  allowFreeStandingZoneFaces yes;
}

snapControls
{
  nSmoothPatch 5;
  tolerance 5;
  nSolveIter 800;
  nRelaxIter 5;
  nFeatureSnapIter 30;
  implicitFeatureSnap       true;
  explicitFeatureSnap       false ;
  multiRegionFeatureSnap no;
}

addLayersControls

{
  relativeSizes yes;
  expansionRatio 1.2;
  finalLayerThickness 0.4;
  firstLayersThickness 0.1;
  minThickness 0.001;
  layers
  {
    aortaWall
    {
      nSurfaceLayers 3;
    }
   
  }
  nGrow 0;
  featureAngle 150;
  slipFeatureAngle 30;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 90;
  nBufferCellsNoExtrude 0;
  nLayerIter 10;
  nRelaxedIter 20;
}

meshQualityControls
{
  maxNonOrtho 45;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minVol 1e-15;
  minTetQuality 1e-09;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 45;
  }
}

debug 0;

mergeTolerance 1e-08; 	// ************************************************************************* //

